src/main/resources/user-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                 xmlns:us="http://miroliubov.com/spring-boot-soap-example">

    <soapenv:Header/>
    <soapenv:Body>
        <us:getUserRequest>
            <us:name>Slava</us:name>
        </us:getUserRequest>
    </soapenv:Body>
</soapenv:Envelope>